// todo Введення користувача та розгалуження
/*
 * Напиши скрипт, який питатиме логін за допомогою prompt і логуватиме результат у консоль браузера.

* Якщо відвідувач вводить "Адмін", то prompt запитує пароль

* Якщо нічого не введено або натиснута клавіша Esc - вивести рядок "Скасовано"

* В іншому випадку вивести рядок "Я вас не знаю"
* Пароль перевіряти так:

* Якщо введено пароль "Я адмін", то вивести рядок "Вітаю!!"
* Інакше виводити рядок "Невірний пароль"
*/

let userInput = prompt('Enter password');

// if (userInput === null) {
//   console.log('Скасовано');
// } else {
//   if (userInput === 'Я адмін') {
//     console.log('Вітаю!!');
//   } else {
//     console.log('Невірний пароль');
//   }
// }

switch (userInput) {
  case null:
    console.log('Скасовано');
    break;

  case 'Я адмін':
    console.log('Вітаю!!');
    break;

  default:
    console.log('Невірний пароль');
    break;
}
