// todo Розгалуження
/*
 * Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач ввів число більше за нуль. Якщо було введено нуль, виводь у консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі має бути рядок "Це від'ємне число".
 */

let userInput = prompt('Введіть число');
userInput = Number(userInput);
let message;

if (userInput === 0) {
  message = 'Це нуль';
} else if (userInput < 0) {
  message = 'це відʼємне число!';
} else {
  message = 'Це позитивне число';
}

console.log(message);
